tatti = ['иккё','никкё','санкё','йонкё','сихо нагэ','ирими нагэ','котэ гаэси','удэ кими нагэ', 'кайтэн нагэ', 'тэнти нагэ','кокю нагэ', 'кокю хо']
suvari = ['иккё','никкё','санкё','йонкё','сихо нагэ','ирими нагэ','котэ гаэси', 'кайтэн нагэ', 'кокю нагэ']
hanmi = ['иккё','никкё','санкё', 'сихо нагэ','ирими нагэ','котэ гаэси', 'кайтэн нагэ', 'кокю нагэ']
attacks = ['шомэн учи', 'ката дори', 'йокомэн учи', 'кататэ дори айханми', 'кататэ дори гяку ханми', 'рётэ дори', 'моротэ дори', 'ката дори мэн учи', 'чудан цки', 'дзёдан цуки', 'уширо рётэ дори']

puts 'Татти вадза:'
puts 'Атака:' + attacks[rand(attacks.length)].ljust(30)
puts 'Техника:' + (tatti[rand(tatti.length)]).to_s.ljust(30)
puts
puts 'Сувари вадза:'
puts 'Атака:' + attacks[rand(2)].ljust(30)
puts 'Техника:' + (suvari[rand(suvari.length)]).to_s.ljust(30)
puts
puts 'Ханми хантаччи вадза:'
puts 'Атака:' + 'кататэ дори гяку ханми'.ljust(30)
puts 'Техника:' + (hanmi[rand(hanmi.length)]).to_s.ljust(30)

